report_02_1000users_loop2/statistics.json
{
  "HTTP Request | Update character" : {
    "transaction" : "HTTP Request | Update character",
    "sampleCount" : 1000,
    "errorCount" : 649,
    "errorPct" : 64.9,
    "meanResTime" : 39.40599999999996,
    "medianResTime" : 22.0,
    "minResTime" : 3.0,
    "maxResTime" : 281.0,
    "pct1ResTime" : 47.0,
    "pct2ResTime" : 235.0,
    "pct3ResTime" : 270.95000000000005,
    "throughput" : 52.66206751277055,
    "receivedKBytesPerSec" : 14.232232312128074,
    "sentKBytesPerSec" : 11.894890216046132
  },
  "HTTP Request | Delete character" : {
    "transaction" : "HTTP Request | Delete character",
    "sampleCount" : 1000,
    "errorCount" : 649,
    "errorPct" : 64.9,
    "meanResTime" : 32.79800000000003,
    "medianResTime" : 21.0,
    "minResTime" : 2.0,
    "maxResTime" : 217.0,
    "pct1ResTime" : 44.89999999999998,
    "pct2ResTime" : 178.0,
    "pct3ResTime" : 212.0,
    "throughput" : 53.44449788894233,
    "receivedKBytesPerSec" : 14.614773729357063,
    "sentKBytesPerSec" : 9.570844857303191
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5000,
    "errorCount" : 2337,
    "errorPct" : 46.74,
    "meanResTime" : 2968.6915999999983,
    "medianResTime" : 24.0,
    "minResTime" : 1.0,
    "maxResTime" : 23972.0,
    "pct1ResTime" : 16419.0,
    "pct2ResTime" : 18299.9,
    "pct3ResTime" : 21329.719999999994,
    "throughput" : 198.11395514700055,
    "receivedKBytesPerSec" : 25544.670672695935,
    "sentKBytesPerSec" : 35.03262224869245
  },
  "HTTP Request | Get all characters" : {
    "transaction" : "HTTP Request | Get all characters",
    "sampleCount" : 1000,
    "errorCount" : 390,
    "errorPct" : 39.0,
    "meanResTime" : 9134.282000000014,
    "medianResTime" : 9902.5,
    "minResTime" : 1.0,
    "maxResTime" : 23972.0,
    "pct1ResTime" : 19347.5,
    "pct2ResTime" : 21328.6,
    "pct3ResTime" : 23719.63,
    "throughput" : 39.6589331746976,
    "receivedKBytesPerSec" : 25522.31957509171,
    "sentKBytesPerSec" : 4.203924375371803
  },
  "HTTP Request | Get character by id" : {
    "transaction" : "HTTP Request | Get character by id",
    "sampleCount" : 1000,
    "errorCount" : 649,
    "errorPct" : 64.9,
    "meanResTime" : 5121.877000000001,
    "medianResTime" : 18.0,
    "minResTime" : 2.0,
    "maxResTime" : 19016.0,
    "pct1ResTime" : 18257.1,
    "pct2ResTime" : 18565.55,
    "pct3ResTime" : 18944.74,
    "throughput" : 49.295080350980975,
    "receivedKBytesPerSec" : 16.17798104296066,
    "sentKBytesPerSec" : 7.569683217489894
  },
  "HTTP Request | Create character" : {
    "transaction" : "HTTP Request | Create character",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 515.0949999999995,
    "medianResTime" : 21.0,
    "minResTime" : 2.0,
    "maxResTime" : 18789.0,
    "pct1ResTime" : 299.69999999999993,
    "pct2ResTime" : 427.0,
    "pct3ResTime" : 18421.73,
    "throughput" : 50.26135906714917,
    "receivedKBytesPerSec" : 14.033521185162845,
    "sentKBytesPerSec" : 11.039436318858062
  }
}