report_03_5000users_loop4/statistics.json
{
  "HTTP Request | Update character" : {
    "transaction" : "HTTP Request | Update character",
    "sampleCount" : 5000,
    "errorCount" : 3546,
    "errorPct" : 70.92,
    "meanResTime" : 3092.5009999999947,
    "medianResTime" : 10.0,
    "minResTime" : 1.0,
    "maxResTime" : 140242.0,
    "pct1ResTime" : 51.0,
    "pct2ResTime" : 1431.8999999999996,
    "pct3ResTime" : 139168.43,
    "throughput" : 35.075412136092595,
    "receivedKBytesPerSec" : 19.317077615310417,
    "sentKBytesPerSec" : 6.896339825938266
  },
  "HTTP Request | Delete character" : {
    "transaction" : "HTTP Request | Delete character",
    "sampleCount" : 5000,
    "errorCount" : 3546,
    "errorPct" : 70.92,
    "meanResTime" : 1831.1654000000028,
    "medianResTime" : 9.0,
    "minResTime" : 1.0,
    "maxResTime" : 139583.0,
    "pct1ResTime" : 75.0,
    "pct2ResTime" : 1570.4499999999834,
    "pct3ResTime" : 118737.34999999174,
    "throughput" : 35.13061562890828,
    "receivedKBytesPerSec" : 15.626619301814145,
    "sentKBytesPerSec" : 5.785401725176707
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 25000,
    "errorCount" : 16216,
    "errorPct" : 64.864,
    "meanResTime" : 13988.801760000042,
    "medianResTime" : 22.0,
    "minResTime" : 0.0,
    "maxResTime" : 145928.0,
    "pct1ResTime" : 68526.40000000001,
    "pct2ResTime" : 119358.95,
    "pct3ResTime" : 140827.97,
    "throughput" : 166.72446448102008,
    "receivedKBytesPerSec" : 17965.795180089513,
    "sentKBytesPerSec" : 24.83276233677675
  },
  "HTTP Request | Get all characters" : {
    "transaction" : "HTTP Request | Get all characters",
    "sampleCount" : 5000,
    "errorCount" : 4704,
    "errorPct" : 94.08,
    "meanResTime" : 49439.47979999995,
    "medianResTime" : 43536.5,
    "minResTime" : 1.0,
    "maxResTime" : 145928.0,
    "pct1ResTime" : 120389.1,
    "pct2ResTime" : 137849.95,
    "pct3ResTime" : 142263.95,
    "throughput" : 33.836596309104074,
    "receivedKBytesPerSec" : 18147.54667890635,
    "sentKBytesPerSec" : 2.8057014876259565
  },
  "HTTP Request | Get character by id" : {
    "transaction" : "HTTP Request | Get character by id",
    "sampleCount" : 5000,
    "errorCount" : 3550,
    "errorPct" : 71.0,
    "meanResTime" : 12587.98059999998,
    "medianResTime" : 69.0,
    "minResTime" : 0.0,
    "maxResTime" : 141136.0,
    "pct1ResTime" : 32318.90000000007,
    "pct2ResTime" : 119749.24999999993,
    "pct3ResTime" : 140749.88999999998,
    "throughput" : 35.042225882188035,
    "receivedKBytesPerSec" : 28.78283566072117,
    "sentKBytesPerSec" : 4.097599717034026
  },
  "HTTP Request | Create character" : {
    "transaction" : "HTTP Request | Create character",
    "sampleCount" : 5000,
    "errorCount" : 870,
    "errorPct" : 17.4,
    "meanResTime" : 2992.8820000000023,
    "medianResTime" : 21.0,
    "minResTime" : 1.0,
    "maxResTime" : 140471.0,
    "pct1ResTime" : 1384.6000000000022,
    "pct2ResTime" : 5207.549999999991,
    "pct3ResTime" : 127969.98,
    "throughput" : 35.09880313081324,
    "receivedKBytesPerSec" : 22.502740722947596,
    "sentKBytesPerSec" : 6.44326278473904
  }
}