report_06_10000users_180sec/statistics.json
{
  "HTTP Request | Update character" : {
    "transaction" : "HTTP Request | Update character",
    "sampleCount" : 44463,
    "errorCount" : 40885,
    "errorPct" : 91.95286,
    "meanResTime" : 3752.176686233495,
    "medianResTime" : 247.0,
    "minResTime" : 0.0,
    "maxResTime" : 137942.0,
    "pct1ResTime" : 14704.00000000003,
    "pct2ResTime" : 68590.35000000003,
    "pct3ResTime" : 136063.91,
    "throughput" : 158.41453638549925,
    "receivedKBytesPerSec" : 283.2988032477509,
    "sentKBytesPerSec" : 9.50020040972655
  },
  "HTTP Request | Delete character" : {
    "transaction" : "HTTP Request | Delete character",
    "sampleCount" : 42630,
    "errorCount" : 39259,
    "errorPct" : 92.09242,
    "meanResTime" : 3562.489960121979,
    "medianResTime" : 237.0,
    "minResTime" : 0.0,
    "maxResTime" : 138134.0,
    "pct1ResTime" : 13813.0,
    "pct2ResTime" : 58497.550000000105,
    "pct3ResTime" : 135867.87000000002,
    "throughput" : 151.89900479962373,
    "receivedKBytesPerSec" : 264.2599448495352,
    "sentKBytesPerSec" : 7.815743064240844
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 232646,
    "errorCount" : 203624,
    "errorPct" : 87.52525,
    "meanResTime" : 6558.345499170323,
    "medianResTime" : 2059.0,
    "minResTime" : 0.0,
    "maxResTime" : 138752.0,
    "pct1ResTime" : 70472.9,
    "pct2ResTime" : 71895.95,
    "pct3ResTime" : 78248.96,
    "throughput" : 800.4059726140508,
    "receivedKBytesPerSec" : 7513.953144890077,
    "sentKBytesPerSec" : 37.574846496981
  },
  "HTTP Request | Get all characters" : {
    "transaction" : "HTTP Request | Get all characters",
    "sampleCount" : 50758,
    "errorCount" : 42797,
    "errorPct" : 84.31577,
    "meanResTime" : 14363.485125497415,
    "medianResTime" : 412.0,
    "minResTime" : 0.0,
    "maxResTime" : 138698.0,
    "pct1ResTime" : 134360.0,
    "pct2ResTime" : 135915.95,
    "pct3ResTime" : 137264.92,
    "throughput" : 174.63075287536253,
    "receivedKBytesPerSec" : 6376.532844867182,
    "sentKBytesPerSec" : 6.604859022944413
  },
  "HTTP Request | Get character by id" : {
    "transaction" : "HTTP Request | Get character by id",
    "sampleCount" : 48285,
    "errorCount" : 44038,
    "errorPct" : 91.20431,
    "meanResTime" : 6160.587615201408,
    "medianResTime" : 270.0,
    "minResTime" : 0.0,
    "maxResTime" : 138752.0,
    "pct1ResTime" : 37033.90000000061,
    "pct2ResTime" : 127210.35,
    "pct3ResTime" : 137176.99,
    "throughput" : 171.45565979447335,
    "receivedKBytesPerSec" : 324.00335128170076,
    "sentKBytesPerSec" : 5.8676176871240475
  },
  "HTTP Request | Create character" : {
    "transaction" : "HTTP Request | Create character",
    "sampleCount" : 46510,
    "errorCount" : 36645,
    "errorPct" : 78.789505,
    "meanResTime" : 3881.855880455802,
    "medianResTime" : 281.0,
    "minResTime" : 0.0,
    "maxResTime" : 137912.0,
    "pct1ResTime" : 17418.000000000015,
    "pct2ResTime" : 69631.95,
    "pct3ResTime" : 136105.0,
    "throughput" : 165.51424717885573,
    "receivedKBytesPerSec" : 304.9260428269449,
    "sentKBytesPerSec" : 8.858918988409377
  }
}